
## Terraform plan for environment: `int`

**Commit:** cfe9a0ca28b7ef870cf5aeca16dfccb106813422


**API version:** 5839261e45
**CLI version:** 5839261e45
**Selfserve version:** f14a88a7fd
**Internal version:** release-v5.13.1
**search version:** 6dd84e6ac4

### Plan summary

`49 to add, 47 to change, 12 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_dashboard.dashboard
module.service.aws_cloudwatch_log_group.this["cancel-unsubmitted-bilateral"]
module.service.aws_cloudwatch_log_group.this["ch-vs-olcs-diffs"]
module.service.aws_cloudwatch_log_group.this["clean-up-variations"]
module.service.aws_cloudwatch_log_group.this["close-expired-windows"]
module.service.aws_cloudwatch_log_group.this["cns"]
module.service.aws_cloudwatch_log_group.this["company-profile-dlq"]
module.service.aws_cloudwatch_log_group.this["create-psv-licence-surrender-task"]
module.service.aws_cloudwatch_log_group.this["data-retention-delete"]
module.service.aws_cloudwatch_log_group.this["data-retention-populate"]
module.service.aws_cloudwatch_log_group.this["data-retention-postcheck"]
module.service.aws_cloudwatch_log_group.this["data-retention-precheck"]
module.service.aws_cloudwatch_log_group.this["database-maintenance"]
module.service.aws_cloudwatch_log_group.this["digital-continuation-reminders"]
module.service.aws_cloudwatch_log_group.this["duplicate-vehicle-warning"]
module.service.aws_cloudwatch_log_group.this["enqueue-ch-compare"]
module.service.aws_cloudwatch_log_group.this["expire-bus-registration"]
module.service.aws_cloudwatch_log_group.this["flag-urgent-tasks"]
module.service.aws_cloudwatch_log_group.this["import-users-from-csv"]
module.service.aws_cloudwatch_log_group.this["inspection-request-email"]
module.service.aws_cloudwatch_log_group.this["interim-end-date-enforcement"]
module.service.aws_cloudwatch_log_group.this["international-goods-export"]
module.service.aws_cloudwatch_log_group.this["last-tm-letter"]
module.service.aws_cloudwatch_log_group.this["licence-status-rules"]
module.service.aws_cloudwatch_log_group.this["mark-expired-permits"]
module.service.aws_cloudwatch_log_group.this["process-cl"]
module.service.aws_cloudwatch_log_group.this["process-company-profile"]
module.service.aws_cloudwatch_log_group.this["process-inbox"]
module.service.aws_cloudwatch_log_group.this["process-insolvency"]
module.service.aws_cloudwatch_log_group.this["process-insolvency-dlq"]
module.service.aws_cloudwatch_log_group.this["process-ntu"]
module.service.aws_cloudwatch_log_group.this["process-queue-community-licences"]
module.service.aws_cloudwatch_log_group.this["process-queue-disc-generation"]
module.service.aws_cloudwatch_log_group.this["process-queue-disc-print"]
module.service.aws_cloudwatch_log_group.this["process-queue-ecmt-accept"]
module.service.aws_cloudwatch_log_group.this["process-queue-general"]
module.service.aws_cloudwatch_log_group.this["process-queue-irhp-allocate"]
module.service.aws_cloudwatch_log_group.this["process-queue-permit-generation"]
module.service.aws_cloudwatch_log_group.this["process-queue-permit-print"]
module.service.aws_cloudwatch_log_group.this["process-queue-print"]
module.service.aws_cloudwatch_log_group.this["psv-operator-list-export"]
module.service.aws_cloudwatch_log_group.this["remove-read-audit"]
module.service.aws_cloudwatch_log_group.this["resolve-payments"]
module.service.aws_cloudwatch_log_group.this["system-parameter"]
module.service.aws_cloudwatch_log_group.this["transxchange-consumer"]
module.service.module.batch.aws_batch_job_queue.this["liquibase"]
module.service.module.batch.aws_batch_scheduling_policy.this["liquibase"]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.aws_cloudwatch_log_group.liquibase
module.service.aws_cloudwatch_log_group.this
module.service.module.batch-liquibase.aws_batch_compute_environment.this["fargate"]
module.service.module.batch-liquibase.aws_batch_job_definition.this["liquibase"]
module.service.module.batch-liquibase.aws_batch_job_queue.this["liquibase"]
module.service.module.batch-liquibase.aws_batch_scheduling_policy.this["liquibase"]
module.service.module.batch-liquibase.aws_iam_instance_profile.instance[0]
module.service.module.batch-liquibase.aws_iam_role.instance[0]
module.service.module.batch-liquibase.aws_iam_role.service[0]
module.service.module.batch-liquibase.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"]
module.service.module.batch-liquibase.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "6063815140968403056" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v5.13.1" -> "5839261e45"
          ~ "deployed_cli_image_tag"       = "release-v5.13.1" -> "5839261e45"
          ~ "deployed_selfserve_image_tag" = "release-v5.13.1" -> "f14a88a7fd"
            # (2 unchanged elements hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.dashboard will be created
  + resource "aws_cloudwatch_dashboard" "dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "ch-vs-olcs-diffs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-clean-up-variations' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "clean-up-variations"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-cns' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "cns"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-create-psv-licence-surrender-task' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "create-psv-licence-surrender-task"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-psv-operator-list-export' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "psv-operator-list-export"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-international-goods-export' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "international-goods-export"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-data-retention-populate' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "data-retention-populate"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-data-retention-precheck' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "data-retention-precheck"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-data-retention-delete' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "data-retention-delete"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-data-retention-postcheck' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "data-retention-postcheck"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-database-maintenance' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "database-maintenance"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-digital-continuation-reminders' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "digital-continuation-reminders"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-duplicate-vehicle-warning' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "duplicate-vehicle-warning"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-enqueue-ch-compare' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "enqueue-ch-compare"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-expire-bus-registration' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "expire-bus-registration"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-flag-urgent-tasks' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "flag-urgent-tasks"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-import-users-from-csv' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "import-users-from-csv"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-inspection-request-email' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "inspection-request-email"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-interim-end-date-enforcement' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "interim-end-date-enforcement"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-last-tm-letter' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "last-tm-letter"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-licence-status-rules' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "licence-status-rules"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-cl' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-cl"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-inbox' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-inbox"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-ntu' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-ntu"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-remove-read-audit' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "remove-read-audit"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-resolve-payments' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "resolve-payments"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-system-parameter' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "system-parameter"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-cancel-unsubmitted-bilateral' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "cancel-unsubmitted-bilateral"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-close-expired-windows' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "close-expired-windows"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-mark-expired-permits' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "mark-expired-permits"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-general' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-general"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-community-licences' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-community-licences"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-disc-generation' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-disc-generation"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-disc-print' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-disc-print"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-ecmt-accept' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-ecmt-accept"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-irhp-allocate' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-irhp-allocate"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-permit-generation' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-permit-generation"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-permit-print' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-permit-print"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-queue-print' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-queue-print"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-company-profile' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-company-profile"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-company-profile-dlq' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "company-profile-dlq"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-insolvency' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-insolvency"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-process-insolvency-dlq' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "process-insolvency-dlq"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-transxchange-consumer' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "transxchange-consumer"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                ]
            }
        )
      + dashboard_name = "batch-vol-app-int"
      + id             = (known after apply)
    }

  # module.service.aws_cloudwatch_log_group.liquibase will be destroyed
  # (because aws_cloudwatch_log_group.liquibase is not in configuration)
  - resource "aws_cloudwatch_log_group" "liquibase" {
      - arn               = "arn:aws:logs:eu-west-1:054614622558:log-group:/aws/batch/liquibase/int" -> null
      - id                = "/aws/batch/liquibase/int" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/batch/liquibase/int" -> null
      - retention_in_days = 1 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "int"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:eu-west-1:054614622558:log-group:/aws/batch/vol-app-int" -> null
      - id                = "/aws/batch/vol-app-int" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/batch/vol-app-int" -> null
      - retention_in_days = 1 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "int"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["cancel-unsubmitted-bilateral"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-cancel-unsubmitted-bilateral"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["ch-vs-olcs-diffs"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-ch-vs-olcs-diffs"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["clean-up-variations"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-clean-up-variations"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["close-expired-windows"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-close-expired-windows"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["cns"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-cns"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["company-profile-dlq"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-company-profile-dlq"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["create-psv-licence-surrender-task"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-create-psv-licence-surrender-task"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["data-retention-delete"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-data-retention-delete"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["data-retention-populate"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-data-retention-populate"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["data-retention-postcheck"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-data-retention-postcheck"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["data-retention-precheck"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-data-retention-precheck"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["database-maintenance"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-database-maintenance"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["digital-continuation-reminders"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-digital-continuation-reminders"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["duplicate-vehicle-warning"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-duplicate-vehicle-warning"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["enqueue-ch-compare"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-enqueue-ch-compare"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["expire-bus-registration"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-expire-bus-registration"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["flag-urgent-tasks"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-flag-urgent-tasks"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["import-users-from-csv"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-import-users-from-csv"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["inspection-request-email"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-inspection-request-email"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["interim-end-date-enforcement"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-interim-end-date-enforcement"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["international-goods-export"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-international-goods-export"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["last-tm-letter"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-last-tm-letter"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["licence-status-rules"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-licence-status-rules"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["mark-expired-permits"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-mark-expired-permits"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-cl"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-cl"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-company-profile"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-company-profile"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-inbox"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-inbox"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-insolvency"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-insolvency"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-insolvency-dlq"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-insolvency-dlq"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-ntu"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-ntu"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-community-licences"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-community-licences"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-disc-generation"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-disc-generation"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-disc-print"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-disc-print"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-ecmt-accept"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-ecmt-accept"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-general"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-general"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-irhp-allocate"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-irhp-allocate"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-permit-generation"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-permit-generation"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-permit-print"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-permit-print"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["process-queue-print"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-process-queue-print"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["psv-operator-list-export"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-psv-operator-list-export"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["remove-read-audit"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-remove-read-audit"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["resolve-payments"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-resolve-payments"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["system-parameter"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn... (truncated, see full plan in the workflow run logs)
```

</details>